[Killed] BlockStatement
src/app/blogs/blog.service.ts:15:43
 
   constructor(private http: HttpClient) { }
 
-  public fetchBlogs(): Observable<Blog[]> {
-    return this.http.get<Blog[]>(BlogService.API_ENDPOINT);
-  }
+  public fetchBlogs(): Observable<Blog[]> {}
 
 }
killedBy: BlogService Should return blogs from Http Get call.
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')
