[Killed] StringLiteral
blog-app/src/app/app.component.ts:9:11
   styleUrls: ['./app.component.sass']
 })
 export class AppComponent {
-  title = 'blog-app';
+  title = "";
 }
 
killedBy: AppComponent should have as title 'blog-app'
statusReason: Error: Expected '' to equal 'blog-app'.
