[Killed] BlockStatement
blog-app/src/app/mutation.example.ts:1:60
-export function validateName(name: string | null): boolean {
-    if (name == null || name.length < 4) {
-        return false;
-    }
-    return true;
-}
+export function validateName(name: string | null): boolean {}
killedBy: Mutation test example. Should return false for short name.
statusReason: Error: Expected undefined to be false.

[Killed] EqualityOperator
blog-app/src/app/mutation.example.ts:2:25
 export function validateName(name: string | null): boolean {
-    if (name == null || name.length < 4) {
+    if (name == null || name.length >= 4) {
         return false;
     }
killedBy: Mutation test example. Should return false for short name.
statusReason: Error: Expected true to be false.

[Killed] ConditionalExpression
blog-app/src/app/mutation.example.ts:2:25
 export function validateName(name: string | null): boolean {
-    if (name == null || name.length < 4) {
+    if (name == null || false) {
         return false;
     }
killedBy: Mutation test example. Should return false for short name.
statusReason: Error: Expected true to be false.

[Killed] BooleanLiteral
blog-app/src/app/mutation.example.ts:3:16
 export function validateName(name: string | null): boolean {
     if (name == null || name.length < 4) {
-        return false;
+        return true;
     }
     return true;
killedBy: Mutation test example. Should return false for short name.
statusReason: Error: Expected true to be false.
